# Задача 32: Определить индексы элементов массива (списка),
# значения которых принадлежат заданному диапазону (т.е. не
# меньше заданного минимума и не больше заданного
# максимума)
# Ввод: [-5, 9, 0, 3, -1, -2, 1,
# 4, -2, 10, 2, 0, -9, 8, 10, -9,
# 0, -5, -5, 7]
# Вывод: [1, 9, 13, 14, 19]

# list_1 = [int (i) for i in input(f'Введите числа: ').split()]
list_1 = [-1,2,3,4,-5,-9]
print(list_1)
min = int(input('Задайте минимум: '))
max = int(input('Задайте максимум: '))
result = []
for i in range(len(list_1)):
    if min<list_1[i]<max:
        result.append(i)
print(result)
