# Задача 2: Найдите сумму цифр трехзначного числа.
# *Пример:*
# 123 -> 6 (1 + 2 + 3)
# 100 -> 1 (1 + 0 + 0)
print("Введите трехзначное число")
n = int(input())
sum = (n - n % 100) / 100 + (n - n % 10 - 100) / 10 + n % 10
sum = int(sum)
print(f"сумма цифр числа {n} = {sum}")
